BAS BMEKZU Project/src/Documents/ГТДИмпорт/ГТДИмпорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГТДИмпорт</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>AccumulationRegister.НДСНалоговыйКредит</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>21</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикТоваров</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоставщикаТоваров</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАкциза</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПошлины</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовПоАвансам</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПошлинаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПошлинаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПошлинаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОформленНалоговыйВексельПоНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВексель</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВексельСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВексельСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВексельСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНДС</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НДССубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НДССубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НДССубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиВекселя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентом</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключаетсяВУточняющийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецРежимНалогообложения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточняемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеДоходовИЗатрат</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСПропорциональноВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСПропорциональноКредит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНДСУсловнаяПродажа</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_НаправлениеОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаПошлины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <comment>(Общ) </comment>
    <attributes>
      <name>НомерРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактурнаяСтоимость</name>
      <comment>Суммарная стоимость позиции по документам поставщика в валюте документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПартии</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДС</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДекларацииНДСНалоговыйКредит</name>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактурнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПартии</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДС</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДекларацииНДСНалоговыйКредит</name>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНАГРО_Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>DocumentRef.ИНАГРО_ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/ГТДИмпорт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет счета учета номенклатуры в табличной части документа
//
Процедура ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, ИмяТабличнойЧасти) Экспорт

	СоответствиеРазделовИСтавокНДС = Новый Соответствие;
	Для каждого СтрокаРаздел Из Объект.Разделы Цикл
		СоответствиеРазделовИСтавокНДС[СтрокаРаздел.НомерСтроки] = СтрокаРаздел.СтавкаНДС;
	КонецЦикла;		

	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	
	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад, ОформленНалоговыйВексельПоНДС");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	СоответствиеСчетовУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаСпискаНоменклатуры(
		ДанныеОбъекта.Организация, ОбщегоНазначения.ВыгрузитьКолонку(ТабличнаяЧасть, "Номенклатура", Истина), ДанныеОбъекта.Склад, ДанныеОбъекта.Дата);
	
	Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		СчетаУчета = СоответствиеСчетовУчета.Получить(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СчетаУчета, СоответствиеРазделовИСтавокНДС[СтрокаТабличнойЧасти.НомерРаздела]);
	КонецЦикла;

КонецПроцедуры

// Заполняет счета учета номенклатуры в строке табличной части документа
//
// Параметры:
//  ДанныеОбъекта         - структура данных объекта, используемых при заполнении счетов учета (вид операции,
//                          вид договора контрагента, признак комиссионной торговли и т.п.)
//  СтрокаТабличнойЧасти  - строка табличной части документа
//  ИмяТабличнойЧасти     - имя табличной части документа
//  СведенияОНоменклатуре - структура сведений о номенклатуре, либо стуктура счетов учета
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СведенияОНоменклатуре, СтавкаНДС) Экспорт
	
	Если СведенияОНоменклатуре = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СведенияОНоменклатуре.Свойство("СчетаУчета") Тогда
		// СведенияОНоменклатуре - структура сведений номенклатуры
		СчетаУчета = СведенияОНоменклатуре.СчетаУчета;
	ИначеЕсли СведенияОНоменклатуре.Свойство("СчетУчетаБУ") Тогда
		// СведенияОНоменклатуре - структура счетов учета номенклатуры
		СчетаУчета = СведенияОНоменклатуре;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ИмяТабличнойЧасти = "Товары" ИЛИ ИмяТабличнойЧасти = "Оборудование" Тогда
		
		Если ЗначениеЗаполнено(СчетаУчета.СчетУчетаБУ) Тогда
			СтрокаТабличнойЧасти.СчетУчетаБУ   = СчетаУчета.СчетУчетаБУ;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные;
		
		Если ЗначениеЗаполнено(СчетаУчета.НалоговоеНазначение) Тогда
			СтрокаТабличнойЧасти.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СтатьяДекларацииНДСНалоговыйКредит = ПолучитьСтатьюНалоговойДекларации(
			СтавкаНДС, 
			СтрокаТабличнойЧасти.НалоговоеНазначение, 
			ДанныеОбъекта.ОформленНалоговыйВексельПоНДС
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьПропорциональныйНДС(Объект, ПлательщикНДС, КоэффициентПропорциональногоНДС) Экспорт 
	
	МассивИменТабличныхЧастей = Новый Массив();
	МассивИменТабличныхЧастей.Добавить("Товары");
	МассивИменТабличныхЧастей.Добавить("Оборудование");
	
	УчетНДСКлиентСервер.РассчитатьПропорциональныйНДС(Объект,МассивИменТабличныхЧастей,ПлательщикНДС,КоэффициентПропорциональногоНДС);
	
КонецПроцедуры

Функция ПолучитьСтатьюНалоговойДекларации(Знач СтавкаНДС, Знач НалоговоеНазначение, Знач ОформленНалоговыйВексельПоНДС) Экспорт
	
	ДляХозяйственнойДеятельности = НалоговоеНазначение <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность;
	ДляОперацийОблагаемыхНДС 	 = НалоговоеНазначение.ВидДеятельностиНДС <> Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	
	// Определим, имеется ли право на налоговый кредит	
	Если  ДляХозяйственнойДеятельности
		И ДляОперацийОблагаемыхНДС Тогда
		
		Если ОформленНалоговыйВексельПоНДС Тогда
			Возврат Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
		Иначе
			Если СтавкаНДС =  Перечисления.СтавкиНДС.НДС0 
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.СпецСт8 // ИНАГРО
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС7
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС14
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				// ст 12.1 Декларации
				Возврат Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРОблагНДСТамож;
			Иначе
				// ст 12.3 Декларации
				Возврат Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРОблагБезНДС;
			КонецЕсли; 
		КонецЕсли; 
	ИначеЕсли ДляХозяйственнойДеятельности Тогда
			// И НЕ ДляОперацийОблагаемыхНДС
		Если ОформленНалоговыйВексельПоНДС Тогда
			Возврат Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
		Иначе
			Если СтавкаНДС =  Перечисления.СтавкиНДС.НДС0
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.СпецСт8 // ИНАГРО
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС7
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС14
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				// ст 13.1.1 Декларации
				Возврат Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРНеОблагНеОбъектНДСТамож;
			Иначе
				// ст 13.1.2 Декларации
				Возврат Справочники.СтатьиНалоговыхДеклараций.НДС_НКИмпортВРНеОблагНеОбъектБезНДС;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		Если ОформленНалоговыйВексельПоНДС Тогда
			Возврат Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
		Иначе		
			Если СтавкаНДС =  Перечисления.СтавкиНДС.НДС0 
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.СпецСт8 // ИНАГРО
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС7
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС14
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				// ст 13.1.1 Декларации
				Возврат Справочники.СтатьиНалоговыхДеклараций.НДС_НКПокупкаСНДСнеВР_;
			Иначе
				// ст 13.1.2 Декларации
				Возврат Справочники.СтатьиНалоговыхДеклараций.НДС_НКПокупкаБезНДСнеВР_;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 

КонецФункции

Процедура УстановитьСчетУчетаНДСилиСчетУчетаВексель(Объект) Экспорт
	
	Если Объект.ОформленНалоговыйВексельПоНДС Тогда
		Объект.СчетУчетаВексель = ПланыСчетов.Хозрасчетный.КраткосрочныеВекселяВыданныеВНациональнойВалюте;
	Иначе
		Если (ЗначениеЗаполнено(Объект.ДоговорПоставщикаТоваров) И Объект.ДоговорПоставщикаТоваров.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
		 ИЛИ Объект.Дата >= '20110101'
			Тогда
			Объект.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;
		Иначе
			Объект.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный;	
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

#Область ЗаполнениеДокумента

Функция ТоварыПоДаннымПоступления(ДанныеОбъекта, ДокументПоступления, НомерРаздела, СтавкаНДС) Экспорт
	
	ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ОснованиеВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления, "ВидОперации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПоступления", ДокументПоступления);
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоТовары,
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
		|	ПоступлениеТоваровУслугТовары.Коэффициент,
		|	ПоступлениеТоваровУслугТовары.Количество,
		|	ПоступлениеТоваровУслугТовары.Сумма,
		|	ПоступлениеТоваровУслугТовары.Ссылка.ИНАГРО_СкладВТЧ КАК СкладВТЧ, // ИНАГРО
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ФактурнаяСтоимость,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаПошлины,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ПоступлениеТоваровУслугТовары.СчетУчетаБУ,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетУчетаНДС,
		|	ПоступлениеТоваровУслугТовары.НалоговоеНазначение,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхДеклараций.ПустаяСсылка) КАК СтатьяДекларацииНДСНалоговыйКредит,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(2, 0)) КАК НомерРаздела,
		|	ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка) КАК ДокументПартии,
		|	ВЫБОР // ИНАГРО
		|		КОГДА ПоступлениеТоваровУслугТовары.Ссылка.ИНАГРО_ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ИНАГРО_ВидыПоступленияТоваров.НаСклад)
		|			ТОГДА ВЫБОР
		|					КОГДА ПоступлениеТоваровУслугТовары.Ссылка.ИНАГРО_СкладВТЧ
		|						ТОГДА ПоступлениеТоваровУслугТовары.ИНАГРО_Склад
		|					ИНАЧЕ ПоступлениеТоваровУслугТовары.Ссылка.Склад
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ИНАГРО_Склад
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &ДокументПоступления";
	
	Если ОснованиеВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|" + "ВЫБРАТЬ
		     |	ЛОЖЬ КАК ЭтоТовары,
		     |	ПоступлениеТоваровУслугОборудование.Номенклатура,
		     |	ПоступлениеТоваровУслугОборудование.ЕдиницаИзмерения,
		     |	ПоступлениеТоваровУслугОборудование.Коэффициент,
		     |	ПоступлениеТоваровУслугОборудование.Количество,
		     |	ПоступлениеТоваровУслугОборудование.Сумма,
			 |	Ложь КАК СкладВТЧ, // ИНАГРО
		     |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Поле1,
		     |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Поле2,
		     |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Поле3,
		     |	ПоступлениеТоваровУслугОборудование.СчетУчетаБУ,
		     |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетУчетаНДС,
		     |	ПоступлениеТоваровУслугОборудование.НалоговоеНазначение,
		     |	ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхДеклараций.ПустаяСсылка) КАК Поле4,
		     |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(2, 0)) КАК Поле5,
		     |	ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка) КАК Поле6,
		     |	NULL КАК ИНАГРО_Склад // ИНАГРО
		     |ИЗ
		     |	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
		     |ГДЕ
		     |	ПоступлениеТоваровУслугОборудование.Ссылка = &ДокументПоступления";
	ИначеЕсли ОснованиеВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия Тогда
		Возврат Новый Структура("Товары, Оборудование", Новый ТаблицаЗначений, Новый ТаблицаЗначений);
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	ТаблицаЗначенийТовары = Запрос.Выполнить().Выгрузить();
	
	// ИНАГРО++
	Если ДанныеОбъекта.Свойство("Склад") Тогда 
		
		ДанныеОбъекта.Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления, "Склад");
		
		СоответствиеСчетовУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаСпискаНоменклатуры(
			ДанныеОбъекта.Организация,
			ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаЗначенийТовары, "Номенклатура", Истина),
			ДанныеОбъекта.Склад,
			ДанныеОбъекта.Дата);
		
	КонецЕсли;
	// ИНАГРО--
	
	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ДокументПоступления,      ВалютаРеглУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ДокументПоступления, ВалютаРеглУчета);
	Для каждого СтрокаТоваров Из ТаблицаЗначенийТовары Цикл
		СтрокаТоваров.НомерРаздела   = НомерРаздела;
		СтрокаТоваров.ДокументПартии = ДокументПоступления;		
		
		// ИНАГРО++
		Если НЕ СтрокаТоваров.СкладВТЧ Тогда
			
			СчетаУчета = СоответствиеСчетовУчета.Получить(СтрокаТоваров.Номенклатура);
			
		Иначе			
			
			СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(
				ДанныеОбъекта.Организация,
				СтрокаТоваров.Номенклатура,
				СтрокаТоваров.ИНАГРО_Склад,
				ДанныеОбъекта.Дата);
			
		КонецЕсли;
	    // ИНАГРО--
		
		СчетУчетаБУИзДокументаОснования = СтрокаТоваров.СчетУчетаБУ;
		
		Документы.ГТДИмпорт.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(
			ДанныеОбъекта, СтрокаТоваров, "Товары", СчетаУчета, СтавкаНДС);
			
		Если ЗначениеЗаполнено(СчетУчетаБУИзДокументаОснования) Тогда
			СтрокаТоваров.СчетУчетаБУ = СчетУчетаБУИзДокументаОснования;
		КонецЕсли;
		
		СтрокаТоваров.ФактурнаяСтоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
			СтрокаТоваров.Сумма,
			ДокументПоступления.ВалютаДокумента, ДанныеОбъекта.ВалютаДокумента,
			КурсДокумента,                       ДанныеОбъекта.КурсДокумента,
			КратностьДокумента,                  ДанныеОбъекта.КратностьДокумента);
		
	КонецЦикла;
	
	ТаблицаЗначенийТовары.Колонки.Удалить("Сумма");
	
	Возврат Новый Структура("Товары, Оборудование", 
		ТаблицаЗначенийТовары.Скопировать(Новый Структура("ЭтоТовары", Истина)), 
		ТаблицаЗначенийТовары.Скопировать(Новый Структура("ЭтоТовары", Ложь))
	);
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru='Реестр документов ""ГТД по импорту""';uk='Реєстр документів ""ВМД по імпорту""'");
	КомандаПечати.Обработчик     = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Контрагент");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
